Repository: flyingrtx2333/AssetTimeMachine
Catalog: AssetTimeMachine/Localizable.xcstrings
Source language: en
Languages: zh_hans, zh_hant

source: Adds a fast-upside bridge and a long-underwater recovery sleeve to the Dual-Engine Regime Router. The growth state scales to 1.082× only when its 28-day equity curve is rising, its drawdown is no more than 1.5%, and either the Nasdaq or S&P 500 is above MA120 with positive 60-day momentum. During the stable state, broad cross-market recovery can temporarily bridge 18.5% toward the growth engine. Once the base strategy has remained underwater for at least 60 trading sessions with a drawdown of 5% or more, up to 15% of idle cash is allocated to a recovery sleeve when either the Nasdaq or S&P 500 is above MA100 with positive 60-day momentum. The sleeve is reviewed every 60 trading sessions, may enter at most twice per underwater episode, observes a 180-session cooldown after exit, and exits quickly when both indices fall 3% over three sessions. Gross exposure is capped at 120%; every signal uses T−1 data and the simulation includes a 1% fee, 0.05% slippage, and 5% annual financing cost.
zh_hans: 在双引擎制度路由上加入快速上涨桥接与长水下恢复袖套：进攻状态在自身28日净值向上、回撤不超过1.5%，且纳指或标普站上MA120并保持60日正动量时放大至1.082倍；稳健状态遇到跨市场广度回升时，短暂向进攻引擎桥接18.5%。当基础净值水下至少60个交易日且回撤达到5%，纳指或标普站上MA100并保持60日正动量时，使用最多15%的闲置现金建立恢复袖套；每60个交易日复核，每个水下周期最多进入2次，退出后冷却180个交易日，双指数3日同时下跌3%时快速退出。总风险封顶120%，全部信号严格使用T−1数据，并统一计入1%交易费、0.05%滑点与5%年化融资成本。
zh_hant: 在雙引擎制度路由上加入快速上漲橋接與長期水下恢復袖套：進攻狀態在自身28日淨值向上、回撤不超過1.5%，且納指或標普站上MA120並保持60日正動量時放大至1.082倍；穩健狀態遇到跨市場廣度回升時，短暫向進攻引擎橋接18.5%。當基礎淨值水下至少60個交易日且回撤達到5%，納指或標普站上MA100並保持60日正動量時，使用最多15%的閒置現金建立恢復袖套；每60個交易日複核，每個水下週期最多進入2次，退出後冷卻180個交易日，雙指數3日同時下跌3%時快速退出。總風險封頂120%，全部訊號嚴格使用T−1資料，並統一計入1%交易費、0.05%滑點與5%年化融資成本。

# 双引擎制度路由
source: Dual-Engine Regime Router
zh_hans: 双引擎制度路由
zh_hant: 雙引擎制度路由

# 双引擎制度路由调仓
source: Dual-engine regime-router rebalance
zh_hans: 双引擎制度路由调仓
zh_hant: 雙引擎制度路由調倉

# 双引擎
source: Dual Engine
zh_hans: 双引擎
zh_hant: 雙引擎

# 252日制度判断
source: 252-Day Regime Signal
zh_hans: 252日制度判断
zh_hant: 252日制度判斷

# 总风险120%
source: 120% Gross Exposure
zh_hans: 总风险120%
zh_hant: 總風險120%

source: Regime-switching experimental strategy: runs a stable risk-contribution engine and a growth risk-contribution engine in parallel. Every 63 trading sessions, using T−1 data only, it compares their trailing 252-session equity curves. It switches to growth when growth leads by at least 2.5% and is above its own 63-session average; it switches back when growth lags by 3% or falls 3% below that average. On the pinned history, the router switched regimes only three times. Gross exposure is capped at 120%, negative cash is financed at 5% annually, and trades require more than an 8% target-weight change. All trades include a 1% fee and 0.05% slippage.
zh_hans: 质变型实验策略：同时运行稳健风险贡献引擎与进攻风险贡献引擎。每63个交易日只用T−1数据比较两者过去252日净值；进攻引擎领先至少2.5%且站上自身63日均值时切换进攻，落后3%或跌破均值3%时切回稳健。历史固定数据中仅发生3次制度切换，总风险封顶120%，负现金按5%年化融资，目标变化超过8%才成交，统一计入1%交易费与0.05%滑点。
zh_hant: 質變型實驗策略：同步運行穩健風險貢獻引擎與進攻風險貢獻引擎。每63個交易日只使用T−1資料比較兩者過去252日淨值；進攻引擎領先至少2.5%且站上自身63日均值時切換進攻，落後3%或跌破均值3%時切回穩健。固定歷史資料中僅發生3次制度切換，總風險封頂120%，負現金按5%年化融資，目標變化超過8%才成交，統一計入1%交易費與0.05%滑點。

# 风险贡献再分配
source: Risk-Contribution Reallocation
zh_hans: 风险贡献再分配
zh_hant: 風險貢獻再分配

# 风险贡献
source: Risk Contribution
zh_hans: 风险贡献
zh_hant: 風險貢獻

# 协方差126日
source: 126-Day Covariance
zh_hans: 协方差126日
zh_hant: 126日共變異數

# 60%再分配
source: 60% Reallocation
zh_hans: 60%再分配
zh_hant: 60%再分配

# 8%调仓带
source: 8% Rebalance Band
zh_hans: 8%调仓带
zh_hant: 8%調倉帶

# 风险贡献再分配调仓
source: Risk-contribution reallocation rebalance
zh_hans: 风险贡献再分配调仓
zh_hant: 風險貢獻再分配調倉

source: Experimental all-round enhancement: first builds target weights from the High-Sharpe State Engine (40%), Aggressive Risk Budget (25%), and Dual-Trend Gold–Nasdaq Barbell (35%), then applies 1.00×, 1.20×, or 1.40× risk scaling according to the underlying engines' exposure consensus. Every 42 trading sessions it estimates up to 126 sessions of covariance. When one asset contributes more than 65% of portfolio risk, 60% of target weights are reallocated toward lower-volatility and less positively correlated assets. When existing US-equity exposure is at least 10%, the target proposes a single 10%–20% increase, and both Nasdaq and S&P 500 five-session momentum are negative, only 60% of the incremental exposure is executed. When China-equity targets fall by at least 15%, US-equity targets rise by 5%–10%, and either Nasdaq or S&P 500 five-session momentum has not turned positive, only 50% of the incremental US exposure is executed to avoid immediately transferring regional exit risk into US equities. Gross exposure is capped at 110%, negative cash is financed at 5% annually, and trades require more than 8% target-weight change. All trades use the unified 1% fee and 0.05% slippage assumptions.
zh_hans: 研究型综合增强组合：先按40%高夏普状态机、25%进取风险预算、35%双趋势金纳生成目标仓位，并按底层仓位共识使用1.00/1.20/1.40倍风险档。每42个交易日估计最多126日协方差；当单一资产风险贡献超过65%时，将60%目标权重按低波动与低正相关方向重新分配。当美股既有仓位至少10%、目标拟一次增加10%至20%，且纳指与标普近5日动量同时转负时，仅执行新增仓位的60%。当A股目标一次减少至少15%、美股目标拟增加5%至10%，且纳指或标普近5日动量至少一个未转正时，仅执行美股新增仓位的50%，避免区域风险退出后立即把风险转移到美股。总风险封顶110%，负现金按5%年化融资，目标权重变化超过8%才成交，统一计入1%交易费与0.05%滑点。
zh_hant: 研究型綜合增強組合：先按40%高夏普狀態機、25%進取風險預算、35%雙趨勢金納槓鈴產生目標倉位，並依底層倉位共識使用1.00／1.20／1.40倍風險檔。每42個交易日估計最多126日共變異數；當單一資產風險貢獻超過65%時，將60%目標權重往低波動與低正相關資產重新分配。當美股既有倉位至少10%、目標擬一次增加10%至20%，且納指與標普近5日動量同時轉負時，僅執行新增倉位的60%。當A股目標一次減少至少15%、美股目標擬增加5%至10%，且納指或標普近5日動量至少一個尚未轉正時，僅執行美股新增倉位的50%，避免區域風險退出後立即把風險轉移到美股。總風險封頂110%，負現金按5%年化融資，目標權重變化超過8%才成交，並統一計入1%交易費與0.05%滑點。

# · %d日动量 %@
source: · %1$d Daily Momentum %2$@
zh_hans: · %d日动量 %@
zh_hant: · %1$d日動量 %2$@

# %@ %d天
source: %1$@ %2$d days
zh_hans: %@ %d天
zh_hant: %1$@ %2$d天

# %@ · %@ · 单次%@ · 仓位%.0f%% · 费率%.2f%% · 滑点%.2f%%
source: %1$@ · %2$@ · Per Trade %3$@ · Exposure %4$.0f%% · Fee %5$.2f%% · Slippage %6$.2f%%
zh_hans: %@ · %@ · 单次%@ · 仓位%.0f%% · 费率%.2f%% · 滑点%.2f%%
zh_hant: %1$@ · %2$@ · 单次%3$@ · 仓位%4$.0f%% · 费率%5$.2f%% · 滑点%6$.2f%%

# %@ · 每%d天投入%@
source: %1$@ · Invest %3$@ every %2$d days
zh_hans: %@ · 每%d天投入%@
zh_hant: %1$@ · 每%2$d天投入%3$@

# %@ · 每天%@
source: %1$@ · %2$@ every day
zh_hans: %@ · 每天%@
zh_hant: %1$@ · 每天%2$@

# %@ · 费率%.2f%% · 滑点%.2f%%
source: %1$@ · Rate %2$.2f%% · Slippage %3$.2f%%
zh_hans: %@ · 费率%.2f%% · 滑点%.2f%%
zh_hant: %1$@ · 费率%2$.2f%% · 滑点%3$.2f%%

# %@。信号截至 %@，建议下一交易日执行。
source: %1$@. The signal ends at %2$@, and it is recommended to execute on the next trading day.
zh_hans: %@。信号截至 %@，建议下一交易日执行。
zh_hant: %1$@。訊號截至 %2$@，建議下一交易日執行。

# %@。当前采用%@作为压力源。
source: %1$@. Currently, %2$@ is used as the pressure source.
zh_hans: %@。当前采用%@作为压力源。
zh_hant: %1$@。目前採用%2$@作為壓力源。

# %@买入%@
source: %1$@ buy %2$@
zh_hans: %@买入%@
zh_hant: %1$@買入%2$@

# %@份
source: %1$@ copies
zh_hans: %@份
zh_hant: %1$@份

# %@保持%@
source: %1$@ remains %2$@
zh_hans: %@保持%@
zh_hant: %1$@保持%2$@

# %@卖出%@
source: %1$@ sells %2$@
zh_hans: %@卖出%@
zh_hant: %1$@賣出%2$@

# %@更新
source: %1$@ update
zh_hans: %@更新
zh_hant: %1$@更新

# %@目标%@
source: %1$@ target %2$@
zh_hans: %@目标%@
zh_hant: %1$@目標%2$@

# %@；%@ 信号截至 %@，建议下一交易日执行。
source: %1$@; %2$@ signal ends at %3$@, it is recommended to execute on the next trading day.
zh_hans: %@；%@ 信号截至 %@，建议下一交易日执行。
zh_hant: %1$@；%2$@ 訊號截至 %3$@，建議下一交易日執行。

# %d 年
source: %1$d year
zh_hans: %d 年
zh_hant: %1$d 年

# %d 年 %d 月
source: %1$d year %2$d month
zh_hans: %d 年 %d 月
zh_hant: %1$d 年 %2$d 月

# %d 月
source: %1$d Month
zh_hans: %d 月
zh_hant: %1$d 月

# %d 项 · 负债 %@
source: %1$d Item · Liability %2$@
zh_hans: %d 项 · 负债 %@
zh_hant: %1$d 項 · 負債 %2$@

# %d日信号未通过，策略建议暂不投入。
source: %1$d daily signal has not passed, the strategy is not to invest yet.
zh_hans: %d日信号未通过，策略建议暂不投入。
zh_hant: %1$d日訊號未通過，策略建議暫不投入。

# %d种资产
source: %1$d assets
zh_hans: %d种资产
zh_hant: %1$d種資產

# 0为关闭
source: 0 to disable
zh_hans: 0为关闭
zh_hant: 0為關閉

# 1个月
source: 1 month
zh_hans: 1个月
zh_hant: 1個月

# 2001年以来优选：黄金65%、标普15.7%、纳指19.3%，需站上MA200且120日动量为正；每20个交易日再平衡，目标波动8.5%
source: Historical candidate since 2001: 65% gold, 15.7% S&P 500, and 19.3% Nasdaq. Each asset must be above its 200-day moving average with positive 120-session momentum. Rebalanced every 20 trading sessions with 8.5% target volatility.
zh_hans: 2001年以来优选：黄金65%、标普15.7%、纳指19.3%，需站上MA200且120日动量为正；每20个交易日再平衡，目标波动8.5%
zh_hant: 2001年以來優選：黃金65%、標普15.7%、納指19.3%，需站上MA200且120日動量為正；每20個交易日再平衡，目標波動8.5%

# 2001年以来进取候选：黄金50%、标普15%、纳指35%，需站上MA220且120日动量为正；每20个交易日再平衡，目标波动11%
source: Growth candidate since 2001: 50% gold, 15% S&P 500, and 35% Nasdaq. Each asset must be above its 220-day moving average with positive 120-session momentum. Rebalanced every 20 trading sessions with 11% target volatility.
zh_hans: 2001年以来进取候选：黄金50%、标普15%、纳指35%，需站上MA220且120日动量为正；每20个交易日再平衡，目标波动11%
zh_hant: 2001年以來進取候選：黃金50%、標普15%、納指35%，需站上MA220且120日動量為正；每20個交易日再平衡，目標波動11%

# 2002年以来候选：纳指+标普做金丝雀，20/60/120/240日动量判断风险环境；进攻选强势权益前2并保留黄金底仓，转弱时只留黄金或现金防守。
source: Candidates since 2002: Nasdaq + S&P as canary, 20/60/120/240 day momentum to judge the risk environment; offensively, choose the top 2 with strong equity and keep the gold bottom position, and when it weakens, only gold or cash will be left for defense.
zh_hans: 2002年以来候选：纳指+标普做金丝雀，20/60/120/240日动量判断风险环境；进攻选强势权益前2并保留黄金底仓，转弱时只留黄金或现金防守。
zh_hant: 2002年以來候選：納指+標普做金絲雀，20/60/120/240日動量判斷風險環境；進攻選強勢權益前2並保留黃金底倉，轉弱時只留黃金或現金防守。

# 20日强势轮动
source: Strong rotation on the 20th
zh_hans: 20日强势轮动
zh_hant: 20日強勢輪動

# 20日强弱排序，每20个交易日切到最强资产，需站上MA60，否则空仓；收益弹性高，但历史最大回撤显著高于其他精选策略。
source: Ranks assets by 20-day relative strength and rotates into the leader every 20 trading sessions, provided it is above its 60-day moving average; otherwise the strategy moves to cash. This higher-return profile has historically experienced materially larger drawdowns than the other Featured strategies.
zh_hans: 20日强弱排序，每20个交易日切到最强资产，需站上MA60，否则空仓；收益弹性高，但历史最大回撤显著高于其他精选策略。
zh_hant: 20日強弱排序，每20個交易日切到最強資產，需站上MA60，否則空倉；收益彈性高，但歷史最大回撤顯著高於其他精選策略。

# 20日强弱排序，每20个交易日持有最强资产；目标波动12%，最高投入90%
source: 20-day strength ranking, hold the strongest assets every 20 trading days; target volatility is 12%, maximum investment is 90%
zh_hans: 20日强弱排序，每20个交易日持有最强资产；目标波动12%，最高投入90%
zh_hant: 20日強弱排序，每20個交易日持有最強資產；目標波動12%，最高投入90%

# 3年
source: 3 years
zh_hans: 3年
zh_hant: 3年

# 5年
source: 5 years
zh_hans: 5年
zh_hant: 5年

# 40日强弱排序，每20个交易日在合格资产里分散持有，按动量/波动加权，目标波动10%，最多投入65%
source: 40-day strength ranking, diversified holdings among eligible assets every 20 trading days, weighted by momentum/volatility, target volatility 10%, maximum investment 65%
zh_hans: 40日强弱排序，每20个交易日在合格资产里分散持有，按动量/波动加权，目标波动10%，最多投入65%
zh_hant: 40日強弱排序，每20個交易日在合格資產里分散持有，按動量/波動加權，目標波動10%，最多投入65%

# 40日强弱排序，每20个交易日调仓，最多持有3个合格资产；目标波动12%，最高投入75%
source: Ranks assets by 40-day relative strength and rebalances every 20 trading sessions, holding up to three qualifying assets. Target volatility is 12%, with maximum exposure of 75%.
zh_hans: 40日强弱排序，每20个交易日调仓，最多持有3个合格资产；目标波动12%，最高投入75%
zh_hant: 40日強弱排序，每20個交易日調倉，最多持有3個合格資產；目標波動12%，最高投入75%

# 40日强弱排序，每20个交易日调仓，最多持有3个合格资产；目标波动12%，最高投入90%
source: Ranks assets by 40-day relative strength and rebalances every 20 trading sessions, holding up to three qualifying assets. Target volatility is 12%, with maximum exposure of 90%.
zh_hans: 40日强弱排序，每20个交易日调仓，最多持有3个合格资产；目标波动12%，最高投入90%
zh_hant: 40日強弱排序，每20個交易日調倉，最多持有3個合格資產；目標波動12%，最高投入90%

# 40日强弱排序，每20个交易日调仓，最多持有3个合格资产；目标波动6%，最高投入35%
source: Ranks assets by 40-day relative strength and rebalances every 20 trading sessions, holding up to three qualifying assets. Target volatility is 6%, with maximum exposure of 35%.
zh_hans: 40日强弱排序，每20个交易日调仓，最多持有3个合格资产；目标波动6%，最高投入35%
zh_hant: 40日強弱排序，每20個交易日調倉，最多持有3個合格資產；目標波動6%，最高投入35%

# 40日强弱排序，每20个交易日调仓，最多持有3个合格资产；目标波动8%，最高投入55%
source: Ranks assets by 40-day relative strength and rebalances every 20 trading sessions, holding up to three qualifying assets. Target volatility is 8%, with maximum exposure of 55%.
zh_hans: 40日强弱排序，每20个交易日调仓，最多持有3个合格资产；目标波动8%，最高投入55%
zh_hant: 40日強弱排序，每20個交易日調倉，最多持有3個合格資產；目標波動8%，最高投入55%

# 5日%@ · 21日%@ · 回撤%@ · 波动%@
source: 5-day %1$@ · 21-day %2$@ · Drawdown %3$@ · Volatility %4$@
zh_hans: 5日%@ · 21日%@ · 回撤%@ · 波动%@
zh_hant: 5日%1$@ · 21日%2$@ · 回撤%3$@ · 波動%4$@

# App-only状态机候选：以单向控波双引擎为基础；当策略自身近90日收益转弱或回撤扩大时，把风险预算降到70%，恢复后再打开。
source: Balanced dual-engine allocation. When the strategy's trailing 90-day return weakens or drawdown deepens, the risk budget is reduced to 70%; full exposure is restored after conditions recover.
zh_hans: App-only状态机候选：以单向控波双引擎为基础；当策略自身近90日收益转弱或回撤扩大时，把风险预算降到70%，恢复后再打开。
zh_hant: App-only狀態機候選：以單向控波雙引擎為基礎；當策略本身近90日收益轉弱或回撤擴大時，把風險預算降到70%，恢復後再打開。

# Apple 登录成功，正在准备云同步
source: Apple login successful, preparing for cloud synchronization
zh_hans: Apple 登录成功，正在准备云同步
zh_hant: Apple 登入成功，正在準備雲端同步

# A股过热不追高动量
source: A shares are overheated and do not chase high momentum
zh_hans: A股过热不追高动量
zh_hant: A股過熱不追高動量

# A股过热不追高动量建仓
source: China-Equity Overheat Guard Entry
zh_hans: A股过热不追高动量建仓
zh_hant: A股過熱不追高動量建倉

# BOLL上轨
source: Bollinger Upper Band
zh_hans: BOLL上轨
zh_hant: BOLL上軌

# BOLL下轨
source: Bollinger Lower Band
zh_hans: BOLL下轨
zh_hant: BOLL下軌

# MA20 上穿 MA60
source: MA20 Crosses Above MA60
zh_hans: MA20 上穿 MA60
zh_hant: MA20 上穿 MA60

# MA20 下穿 MA60
source: MA20 Crosses Below MA60
zh_hans: MA20 下穿 MA60
zh_hant: MA20 下穿 MA60

# MA死叉
source: MA Death Cross
zh_hans: MA死叉
zh_hant: MA死叉

# MA金叉
source: MA Golden Cross
zh_hans: MA金叉
zh_hant: MA金叉

# WTI原油
source: WTI crude oil
zh_hans: WTI原油
zh_hant: WTI原油

# iOS 双向云同步
source: iOS two-way cloud sync
zh_hans: iOS 双向云同步
zh_hant: iOS 雙向雲端同步

# 万
source: 10K
zh_hans: 万
zh_hant: 萬

# 上架候选：以近期亏损波动元策略为核心，黄金趋势和相对强度有效时挂10%黄金卫星；组合总仓位封顶85%，单个权益指数最多64%，并保留二月弱势刹车和净值轻刹车。
source: Candidates for listing: With the recent loss-volatility meta strategy as the core, 10% gold satellite is attached when the gold trend and relative strength are effective; the total portfolio position is capped at 85%, and the single equity index is up to 64%, and the February weak brake and net value light brake are retained.
zh_hans: 上架候选：以近期亏损波动元策略为核心，黄金趋势和相对强度有效时挂10%黄金卫星；组合总仓位封顶85%，单个权益指数最多64%，并保留二月弱势刹车和净值轻刹车。
zh_hant: 上架候選：以近期虧損波動元策略為核心，黃金趨勢和相對強度有效時掛10%黃金衛星；組合總倉位封頂85%，單一權益指數最多64%，並保留二月弱勢煞車和淨值輕煞車。

# 上穿BOLL中轨
source: Crosses Above Bollinger Midline
zh_hans: 上穿BOLL中轨
zh_hant: 上穿BOLL中軌

# 下穿BOLL中轨
source: Crosses Below Bollinger Midline
zh_hans: 下穿BOLL中轨
zh_hant: 下穿BOLL中軌

# 不主动卖出
source: Not actively selling
zh_hans: 不主动卖出
zh_hant: 不主動賣出

source: Strictly unlevered strategy built on the Confidence Recovery engine and a recovery sleeve capped at 20.75%, with total exposure limited to 100%. It deploys idle cash more fully when volatility is low and trends are confirmed, while volatility-based turnover bands reduce unnecessary rebalancing. Near portfolio highs, 80% of scheduled risk reduction is executed, with a 5% China-equity exit buffer retained. All signals use T−1 data; leverage and negative cash balances are prohibited. Results include a 1.00% trading fee and 0.05% slippage.
zh_hans: 严格无杠杆增强策略：沿用置信度恢复底层和20.75%恢复袖套，以100%总仓硬上限运行；关闭历史上冗余的宽度微刹车与成熟纳指刹车，在低波且趋势确认时更充分使用闲置现金。领导资产保持不变且总风险变化不超过2%时，按组合波动采用20%/30%/50%的分级换手过滤；黄金领导且60日组合波动达到12%时恢复更快调仓。近峰减仓执行80%，并保留5%的A股退出哨兵。全部信号严格使用T−1数据，禁止融资和负现金，统一计入1%交易费与0.05%滑点。
zh_hant: 嚴格無槓桿增強策略：沿用置信度恢復底層和20.75%恢復袖套，以100%總倉硬上限運行；關閉歷史上冗餘的寬度微剎車與成熟納指剎車，在低波且趨勢確認時更充分使用閒置現金。領導資產不變且總風險變化不超過2%時，以組合波動採用20%/30%/50%的分級換手過濾；黃金領導且60日組合波動達到12%時恢復較快調倉。近峰減倉執行80%，並保留5%的A股退出哨兵。全部訊號嚴格使用T−1數據，禁止融資負現金，統一計入1%交易費與0.05%滑點。

# 中国人民银行 · 金融机构人民币存款基准利率
source: People's Bank of China·RMB deposit benchmark interest rate for financial institutions
zh_hans: 中国人民银行 · 金融机构人民币存款基准利率
zh_hant: 中國人民銀行 · 金融機構人民幣存款基準利率

# 九月风险闸门趋势
source: September Risk Gate Trends
zh_hans: 九月风险闸门趋势
zh_hant: 九月風險閘門趨勢

# 九月风险闸门趋势建仓
source: September Risk-Gate Trend Entry
zh_hans: 九月风险闸门趋势建仓
zh_hant: 九月風險閘門趨勢建倉

# 买%d · 卖%d
source: Buy %1$d · Sell %2$d
zh_hans: 买%d · 卖%d
zh_hant: 買%1$d · 賣%2$d

# 买入持有
source: Buy and hold
zh_hans: 买入持有
zh_hant: 買入持有

# 买入条件
source: Buy Rule
zh_hans: 买入条件
zh_hant: 買入條件

# 云同步已完成
source: Cloud synchronization completed
zh_hans: 云同步已完成
zh_hant: 雲端同步已完成

# 云端数据中存在无法识别的资产分类引用
source: Unrecognized asset classification reference exists in cloud data
zh_hans: 云端数据中存在无法识别的资产分类引用
zh_hant: 雲端資料中存在無法辨識的資產分類引用

# 云端数据中存在无法识别的资产项目引用
source: There is an unrecognized asset item reference in the cloud data
zh_hans: 云端数据中存在无法识别的资产项目引用
zh_hant: 雲端資料中存在無法辨識的資產項目引用

# 云端数据中存在重复的%@
source: Duplicate %1$@ exists in cloud data
zh_hans: 云端数据中存在重复的%@
zh_hant: 雲端資料中存在重複的%1$@

# 互换条件
source: Swap Rules
zh_hans: 互换条件
zh_hant: 互換條件

# 交易次数
source: Trades
zh_hans: 交易次数
zh_hant: 交易次數

# 交易费率
source: Fee
zh_hans: 交易费率
zh_hant: 交易費率

# 人民币活期存款基准利率
source: RMB demand deposit benchmark interest rate
zh_hans: 人民币活期存款基准利率
zh_hant: 人民幣活期存款基準利率

# 亿
source: 100M
zh_hans: 亿
zh_hant: 億

# 今年年结余
source: Year-to-Date Surplus
zh_hans: 今年年结余
zh_hant: 今年年結餘

# 今年月均结余
source: Average Monthly Surplus
zh_hans: 今年月均结余
zh_hant: 今年月均結餘

# 今年至今
source: Year to date
zh_hans: 今年至今
zh_hant: 今年至今

# 今日策略
source: Today's strategy
zh_hans: 今日策略
zh_hant: 今日策略

# 今日调仓建议
source: Today's Rebalance
zh_hans: 今日调仓建议
zh_hant: 今日調倉建議

# 今日调仓提醒
source: Today's Rebalance Alert
zh_hans: 今日调仓提醒
zh_hant: 今日調倉提醒

# 价上穿MA20
source: Price crosses MA20
zh_hans: 价上穿MA20
zh_hant: 價上穿MA20

# 价下穿MA20
source: Price below MA20
zh_hans: 价下穿MA20
zh_hant: 價下穿MA20

# 价格上穿 BOLL 中轨
source: Price Crosses Above Bollinger Midline
zh_hans: 价格上穿 BOLL 中轨
zh_hant: 價格上穿 BOLL 中軌

# 价格上穿 MA20
source: Price goes up MA20
zh_hans: 价格上穿 MA20
zh_hant: 價格上穿 MA20

# 价格下穿 BOLL 中轨
source: Price Crosses Below Bollinger Midline
zh_hans: 价格下穿 BOLL 中轨
zh_hant: 價格下穿 BOLL 中軌

# 价格下穿 MA20
source: Price drops below MA20
zh_hans: 价格下穿 MA20
zh_hant: 價格下穿 MA20

# 价格低于 MA20
source: Price lower than MA20
zh_hans: 价格低于 MA20
zh_hant: 價格低於 MA20

# 价格低于 MA60
source: Price lower than MA60
zh_hans: 价格低于 MA60
zh_hant: 價格低於 MA60

# 价格高于 MA20
source: Price higher than MA20
zh_hans: 价格高于 MA20
zh_hant: 價格高於 MA20

# 价格高于 MA60
source: Price higher than MA60
zh_hans: 价格高于 MA60
zh_hant: 價格高於 MA60

# 低于
source: Below
zh_hans: 低于
zh_hant: 低於

# 低于MA20
source: Below MA20
zh_hans: 低于MA20
zh_hant: 低於MA20

# 低于MA60
source: Below MA60
zh_hans: 低于MA60
zh_hant: 低於MA60

# 低回撤
source: Low drawdown
zh_hans: 低回撤
zh_hant: 低迴撤

# 低回撤轮动
source: Low drawdown rotation
zh_hans: 低回撤轮动
zh_hant: 低迴撤輪動

# 低回撤轮动建仓
source: Low-Drawdown Rotation Entry
zh_hans: 低回撤轮动建仓
zh_hant: 低迴撤輪動建倉

# 低频
source: Low frequency
zh_hans: 低频
zh_hant: 低頻

# 使用中
source: Active
zh_hans: 使用中
zh_hant: 使用中

# 例如 0.05
source: e.g., 0.05
zh_hans: 例如 0.05
zh_hant: 例如 0.05

# 例如 1
source: e.g., 1
zh_hans: 例如 1
zh_hant: 例如 1

# 例如 10000
source: For example 10000
zh_hans: 例如 10000
zh_hant: 例如 10000

# 例如 100000
source: e.g., 100,000
zh_hans: 例如 100000
zh_hant: 例如 100000

# 例如 3
source: Example 3
zh_hans: 例如 3
zh_hant: 例如 3

# 例如 70
source: Example 70
zh_hans: 例如 70
zh_hant: 例如 70

# 保存到相册
source: Save to album
zh_hans: 保存到相册
zh_hant: 儲存到相冊

# 保存后的回测会出现在这里
source: Saved backtests will appear here
zh_hans: 保存后的回测会出现在这里
zh_hant: 儲存後的回測會出現在這裡

# 保存时间
source: Save time
zh_hans: 保存时间
zh_hant: 保存時間

# 保存登录凭证失败（%d）
source: Failed to save login credentials (%1$d)
zh_hans: 保存登录凭证失败（%d）
zh_hant: 儲存登入憑證失敗（%1$d）

# 保持
source: Keep
zh_hans: 保持
zh_hant: 維持

# 候选
source: Candidate
zh_hans: 候选
zh_hant: 候選

# 偏离不大，今日可保持。
source: The deviation is not big and can be maintained today.
zh_hans: 偏离不大，今日可保持。
zh_hant: 偏離不大，今日可保持。

# 偏离小
source: Small deviation
zh_hans: 偏离小
zh_hant: 偏離小

# 元
source: CNY
zh_hans: 元
zh_hant: 元

# 全球修复传染控制
source: Global Repair Infection Control
zh_hans: 全球修复传染控制
zh_hant: 全球修復傳染控制

# 全球修复传染控制建仓
source: Global Recovery Contagion Control Entry
zh_hans: 全球修复传染控制建仓
zh_hant: 全球修復傳染控制建倉

# 全选
source: Select all
zh_hans: 全选
zh_hant: 全選

# 全部可用区间
source: All available intervals
zh_hans: 全部可用区间
zh_hant: 全部可用區間

# 全部回测记录
source: All Backtest Records
zh_hans: 全部回测记录
zh_hant: 全部回測記錄

# 共%d条记录
source: %1$d Records
zh_hans: 共%d条记录
zh_hant: 共%1$d筆記錄

# 内部进攻引擎：在黄金交接保护基础上，把空余风险预算分配给趋势确认的权益指数，用于元策略对照，不单独推荐。
source: Internal attack engine: On the basis of gold handover protection, allocate the spare risk budget to the equity index of trend confirmation, which is used for meta-strategy comparison and is not recommended separately.
zh_hans: 内部进攻引擎：在黄金交接保护基础上，把空余风险预算分配给趋势确认的权益指数，用于元策略对照，不单独推荐。
zh_hant: 內部進攻引擎：在黃金交接保護基礎上，把空餘風險預算分配給趨勢確認的權益指數，用於元策略對照，不單獨推薦。

# 内部进攻袖套：在单向控波基础上，只用空余预算承接确认加速且波动收缩的道指、深成指或创业板。
source: Internal offensive sleeve: On the basis of one-way wave control, only use spare budget to undertake the Dow, Shenzhen Component Index or GEM that confirms acceleration and contraction of volatility.
zh_hans: 内部进攻袖套：在单向控波基础上，只用空余预算承接确认加速且波动收缩的道指、深成指或创业板。
zh_hant: 內部進攻袖套：在單向控波基礎上，只用空餘預算承接確認加速且波動收縮的道指、深成指或創業板。

# 内部防守袖套：在单向控波基础上，根据组合自身回撤和快速上涨后的锁盈状态平滑降低风险预算。
source: Defensive sleeve that gradually reduces the risk budget when portfolio drawdown deepens or a rapid advance triggers profit protection.
zh_hans: 内部防守袖套：在单向控波基础上，根据组合自身回撤和快速上涨后的锁盈状态平滑降低风险预算。
zh_hant: 內部防守袖套：在單向控波基礎上，根據組合自身回撤和快速上漲後的鎖盈狀態平滑降低風險預算。

# 冲击
source: Shock
zh_hans: 冲击
zh_hant: 衝擊

# 冷却天数
source: Cooldown
zh_hans: 冷却天数
zh_hant: 冷卻天數

# 净值走势
source: Equity Curve
zh_hans: 净值走势
zh_hant: 淨值走勢

# 分享
source: Share
zh_hans: 分享
zh_hant: 分享

# 分资产结果
source: Results by Asset
zh_hans: 分资产结果
zh_hant: 分資產結果

# 创业板
source: GEM
zh_hans: 创业板
zh_hant: 創業板

# 初始资金
source: Initial Capital
zh_hans: 初始资金
zh_hant: 初始資金

# 删除
source: Delete
zh_hans: 删除
zh_hant: 刪除

# 删除匹配记录
source: Delete matching records
zh_hans: 删除匹配记录
zh_hant: 刪除符合記錄

# 删除匹配记录？
source: Delete matching records?
zh_hans: 删除匹配记录？
zh_hant: 刪除匹配記錄？

# 删除记录
source: Delete record
zh_hans: 删除记录
zh_hant: 刪除記錄

# 删除选中记录？
source: Delete selected records?
zh_hans: 删除选中记录？
zh_hant: 刪除選取記錄？

# 制度路由稳健引擎
source: Institutional Routing Robust Engine
zh_hans: 制度路由稳健引擎
zh_hant: 制度路由穩健引擎

# 制度路由进攻引擎
source: Institutional routing attack engine
zh_hans: 制度路由进攻引擎
zh_hant: 制度路由進攻引擎

# 剩余现金
source: Remaining Cash
zh_hans: 剩余现金
zh_hant: 剩餘現金

# 剩余配额 %d%%
source: Remaining quota %1$d%%
zh_hans: 剩余配额 %d%%
zh_hant: 剩餘配額 %1$d%%

# 动态袖套夏普策略
source: Dynamic Sleeve Sharpe Strategy
zh_hans: 动态袖套夏普策略
zh_hant: 動態袖套夏普策略

# 动态袖套夏普策略建仓
source: Dynamic-Sleeve Sharpe Entry
zh_hans: 动态袖套夏普策略建仓
zh_hant: 動態袖套夏普策略建倉

# 区间平均分
source: Average Score
zh_hans: 区间平均分
zh_hant: 區間平均分

# 区间平均年利率
source: Range average annual interest rate
zh_hans: 区间平均年利率
zh_hant: 區間平均年利率

# 半个月
source: Half a month
zh_hans: 半个月
zh_hant: 半個月

# 单向控波元策略
source: One-Way Volatility-Control Meta-Strategy
zh_hans: 单向控波元策略
zh_hant: 單向控波元策略

# 单向控波元策略建仓
source: One-Way Volatility-Control Meta-Strategy Entry
zh_hans: 单向控波元策略建仓
zh_hant: 單向控波元策略建倉

# 单次%@ · 仓位%.0f%% · 费率%.2f%% · 滑点%.2f%% · 年化%@ · 回撤%@ · 夏普%@
source: Per trade %1$@ · Exposure %2$.0f%% · Fee %3$.2f%% · Slippage %4$.2f%% · Annualized %5$@ · Drawdown %6$@ · Sharpe %7$@
zh_hans: 单次%@ · 仓位%.0f%% · 费率%.2f%% · 滑点%.2f%% · 年化%@ · 回撤%@ · 夏普%@
zh_hant: 單次%1$@ · 倉位%2$.0f%% · 費率%3$.2f%% · 滑點%4$.2f%% · 年化%5$@ · 回撤%6$@ · 夏普%7$@

# 单次买入金额
source: Amount per Trade
zh_hans: 单次买入金额
zh_hant: 單次買入金額

# 卖出
source: Sell
zh_hans: 卖出
zh_hant: 賣出

# 卖出条件
source: Sell Rule
zh_hans: 卖出条件
zh_hant: 賣出條件

# 历史 K 线
source: Historical K-line
zh_hans: 历史 K 线
zh_hant: 歷史 K 線

# 历史活期利率
source: Historical demand interest rate
zh_hans: 历史活期利率
zh_hant: 歷史活期利率

# 历史记录
source: History
zh_hans: 历史记录
zh_hant: 歷史記錄

# 历史风险信号
source: Historical Risk Signals
zh_hans: 历史风险信号
zh_hant: 歷史風險訊號

# 压力
source: Pressure
zh_hans: 压力
zh_hant: 壓力

# 压力日占比
source: Stress Days
zh_hans: 压力日占比
zh_hant: 壓力日占比

# 压缩日历桶风险预算复合
source: Compressed Calendar Bucket Risk Budget Compounding
zh_hans: 压缩日历桶风险预算复合
zh_hant: 壓縮日曆桶風險預算複合

# 双向同步完成
source: Bidirectional synchronization completed
zh_hans: 双向同步完成
zh_hant: 雙向同步完成

# 双金丝雀动量防守建仓
source: Dual-Canary Momentum Defense Entry
zh_hans: 双金丝雀动量防守建仓
zh_hant: 雙金絲雀動量防禦建倉

# 发送测试提醒
source: Send test reminder
zh_hans: 发送测试提醒
zh_hant: 發送測試提醒

# 取消全选
source: Unselect all
zh_hans: 取消全选
zh_hant: 取消全選

# 变化 %@%@ / %@
source: Change %1$@%2$@ / %3$@
zh_hans: 变化 %@%@ / %@
zh_hant: 變化 %1$@%2$@ / %3$@

# 另有%d项。
source: There is another item %1$d.
zh_hans: 另有%d项。
zh_hant: 另有%1$d項。
